PatternSearchClient/TER_L3/Aide_dipwm.org
#+TITLE: Aide projet TER L3
#+SUBTITLE: 
#+Language:fr
#+AUTHOR: Eric Rivals
#+EMAIL:rivals@lirmm.fr

# # OPTIONs LATEX
#+OPTIONS: H:2 num:1 toc:1 *:t @:t ::t |:t ^:t f:t TeX:nil \n:t _:nil
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [11pt, a4paper]
#+LATEX_HEADER: \usepackage[a4paper,hmargin=20mm,vmargin=20mm]{geometry}
#+LATEX_HEADER: \usepackage[french]{babel} \usepackage{pslatex}  
#+LATEX_HEADER: \usepackage[normalem]{ulem}
#+LATEX_HEADER: \renewcommand{\baselinestretch}{1.02}
#+LATEX_HEADER: \usepackage[ruled,vlined,linesnumbered]{algorithm2e}
#+LATEX_HEADER: \usepackage{amsmath,amsfonts}

# # 
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+HTML_CONTAINER: div
#+HTML_DOCTYPE: xhtml-strict
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/style.css" title="default" />
#+HTML_HEAD_EXTRA: 
#+HTML_LINK_HOME:   http://www.lirmm.fr/~rivals/
#+HTML_LINK_UP:     http://www.lirmm.fr/~rivals/
#+LINK_HOME:   http://www.lirmm.fr/~rivals/
#+LINK_UP:     http://www.lirmm.fr/~rivals/

* Fichiers dipwm
- un fichier pour une dipwm
- ext =.dpwm=
- ex: =FOXP1_HUMAN.H11DI.0.A.dpwm=

** Organisation
Dans [[./dipwm]] :
- une archive contenant toutes les dipwm humaines de HOCOMOCO
- un répertoire =pwm_single= contenant 3 fichiers de dipwm

** Struture / format
1. Une ligne d'identifiant commençant par =>=
 #+begin_example
 >FOXP1_HUMAN.H11DI.0.A
 #+end_example

2. Ensuite, une ligne par position du motif
3. 16 colonnes donnant les scores des dinucléotides "AA" "AC", ..., "TG", "TT"


* Fichiers de séquence au format FASTA
- Fichier texte (attention encodage linux -- on peut faire un =dos2unix= pour passer de dos à unix. Avez vous un équivalent windows ?)
- Extensions classiques: =.fa= ou =.fasta=

** Organisation
Dans le répertoire [[./seq]] :
- =simple.fa= contient une seule séquence
- =triple.fa= contient trois séquences à la suite
- =chr15.fa.gz= contient la séquence complète du chromosome 15 humain

** Struture / format
Format comme expliqué hier, voir aussi https://fr.wikipedia.org/wiki/FASTA_(format_de_fichier)
1. Une ligne d'identifiant commençant par =>=
  #+begin_example
  >first
  #+end_example
2. Des lignes de séquences
  #+begin_example
  tggaagggctaattcactcccaacgaagacaagatatccttgatctgtgg
  atctaccacacacaaggctacttccctgattagcagaactacacaccagg
  gccagggatcagatatccactgacctttggatggtgctacaagctagtac
  cgacgcaggactcg
  #+end_example
3. alphabet simple ={ A, C, G, T}= ou alphabet étendu dit IUPAC pour ADN contient aussi ={N, Y, R, W, ... }= mais pas de caractères non alphabétiques.





* Documentation
** Calcul du  seuil à partir d'un ratio
Le ratio est un pourcentage généralement compris entre 80 et 100%

Si on note le seuil par $\theta$ voici la formule

#+begin_center
        \[\theta = (score_{max}-score_{min})*ratio + score_{min}\]
#+end_center
# #+begin_export latex
# #+end_export

** Documents répertoire [[./doc]]
- présentation : [[./doc/rivals_dipwm_seqbim.pdf]]
- résumé anglais de la présentation: [[./doc/dipwmsearch_seqBIM_2021.pdf]]
- [[./doc/notation_LAT_def.pdf]] : document donnant quelques notations et une définition de la LAT
- =LAM_def.png= : image avec définition de la LAM

** Ressources
- HOCOMOCO: https://hocomoco11.autosome.ru/



* À faire
- Voir mail du 23/03/2022
- code pour vérifier la LAM
- code pour vérifier l'énumération (je vous fournirai des listes de mots valides)
- recherche multi séquences et indexation multi-séquences
- installation sur machine linux

* Fait
** Algorithme pour le calcul de la LAT et de LAM 
- voir présentation
** Lecture / parcours de fichier FASTA 
** Recherche d'une libraire pour Aho-Corasick en C++
