PatternSearchClient/TER_L3/Aide_dipwm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2022-03-24 jeu. 11:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aide projet TER L3</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Eric Rivals" />
<link rel="stylesheet" type="text/css" href="css/style.css" title="default" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="http://www.lirmm.fr/~rivals/"> UP </a>
 |
 <a accesskey="H" href="http://www.lirmm.fr/~rivals/"> HOME </a>
</div><div id="content">
<h1 class="title">Aide projet TER L3</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org34d4f7d">1. Fichiers dipwm</a></li>
<li><a href="#org618c309">2. Fichiers de séquence au format FASTA</a></li>
<li><a href="#orgb424e79">3. Documentation</a></li>
<li><a href="#org443fde4">4. À faire</a></li>
<li><a href="#org8d2ce92">5. Fait</a></li>
</ul>
</div>
</div>

<div id="outline-container-org34d4f7d" class="outline-2">
<h2 id="org34d4f7d"><span class="section-number-2">1</span> Fichiers dipwm</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>un fichier pour une dipwm<br /></li>
<li>ext <code>.dpwm</code><br /></li>
<li>ex: <code>FOXP1_HUMAN.H11DI.0.A.dpwm</code><br /></li>
</ul>
</div>

<div id="outline-container-org88bd1bc" class="outline-3">
<h3 id="org88bd1bc">Organisation</h3>
<div class="outline-text-3" id="text-org88bd1bc">
<p>
Dans <a href="./dipwm">./dipwm</a> :<br />
</p>
<ul class="org-ul">
<li>une archive contenant toutes les dipwm humaines de HOCOMOCO<br /></li>
<li>un répertoire <code>pwm_single</code> contenant 3 fichiers de dipwm<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org084f291" class="outline-3">
<h3 id="org084f291">Struture / format</h3>
<div class="outline-text-3" id="text-org084f291">
<ol class="org-ol">
<li><p>
Une ligne d'identifiant commençant par <code>&gt;</code><br />
</p>
<pre class="example">
&gt;FOXP1_HUMAN.H11DI.0.A
</pre></li>

<li>Ensuite, une ligne par position du motif<br /></li>
<li>16 colonnes donnant les scores des dinucléotides "AA" "AC", &#x2026;, "TG", "TT"<br /></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org618c309" class="outline-2">
<h2 id="org618c309"><span class="section-number-2">2</span> Fichiers de séquence au format FASTA</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Fichier texte (attention encodage linux &#x2013; on peut faire un <code>dos2unix</code> pour passer de dos à unix. Avez vous un équivalent windows ?)<br /></li>
<li>Extensions classiques: <code>.fa</code> ou <code>.fasta</code><br /></li>
</ul>
</div>

<div id="outline-container-orge910725" class="outline-3">
<h3 id="orge910725">Organisation</h3>
<div class="outline-text-3" id="text-orge910725">
<p>
Dans le répertoire <a href="./seq">./seq</a> :<br />
</p>
<ul class="org-ul">
<li><code>simple.fa</code> contient une seule séquence<br /></li>
<li><code>triple.fa</code> contient trois séquences à la suite<br /></li>
<li><code>chr15.fa.gz</code> contient la séquence complète du chromosome 15 humain<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orga0a02f6" class="outline-3">
<h3 id="orga0a02f6">Struture / format</h3>
<div class="outline-text-3" id="text-orga0a02f6">
<p>
Format comme expliqué hier, voir aussi <a href="https://fr.wikipedia.org/wiki/FASTA_(format_de_fichier)">https://fr.wikipedia.org/wiki/FASTA_(format_de_fichier)</a><br />
</p>
<ol class="org-ol">
<li><p>
Une ligne d'identifiant commençant par <code>&gt;</code><br />
</p>
<pre class="example">
&gt;first
</pre></li>
<li><p>
Des lignes de séquences<br />
</p>
<pre class="example">
tggaagggctaattcactcccaacgaagacaagatatccttgatctgtgg
atctaccacacacaaggctacttccctgattagcagaactacacaccagg
gccagggatcagatatccactgacctttggatggtgctacaagctagtac
cgacgcaggactcg
</pre></li>
<li>alphabet simple <code>{ A, C, G, T}</code> ou alphabet étendu dit IUPAC pour ADN contient aussi <code>{N, Y, R, W, ... }</code> mais pas de caractères non alphabétiques.<br /></li>
</ol>
</div>
</div>
</div>





<div id="outline-container-orgb424e79" class="outline-2">
<h2 id="orgb424e79"><span class="section-number-2">3</span> Documentation</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5893e0a" class="outline-3">
<h3 id="org5893e0a">Calcul du  seuil à partir d'un ratio</h3>
<div class="outline-text-3" id="text-org5893e0a">
<p>
Le ratio est un pourcentage généralement compris entre 80 et 100%<br />
</p>

<p>
Si on note le seuil par \(\theta\) voici la formule<br />
</p>

<div class="org-center">
<p>
\[\theta = (score_{max}-score_{min})*ratio + score_{min}\]<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org4a59a77" class="outline-3">
<h3 id="org4a59a77">Documents répertoire <a href="./doc">./doc</a></h3>
<div class="outline-text-3" id="text-org4a59a77">
<ul class="org-ul">
<li>présentation : <a href="./doc/rivals_dipwm_seqbim.pdf">./doc/rivals_dipwm_seqbim.pdf</a><br /></li>
<li>résumé anglais de la présentation: <a href="./doc/dipwmsearch_seqBIM_2021.pdf">./doc/dipwmsearch_seqBIM_2021.pdf</a><br /></li>
<li><a href="./doc/notation_LAT_def.pdf">./doc/notation_LAT_def.pdf</a> : document donnant quelques notations et une définition de la LAT<br /></li>
<li><code>LAM_def.png</code> : image avec définition de la LAM<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgc3afbe0" class="outline-3">
<h3 id="orgc3afbe0">Ressources</h3>
<div class="outline-text-3" id="text-orgc3afbe0">
<ul class="org-ul">
<li>HOCOMOCO: <a href="https://hocomoco11.autosome.ru/">https://hocomoco11.autosome.ru/</a><br /></li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org443fde4" class="outline-2">
<h2 id="org443fde4"><span class="section-number-2">4</span> À faire</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Voir mail du 23/03/2022<br /></li>
<li>code pour vérifier la LAM<br /></li>
<li>code pour vérifier l'énumération (je vous fournirai des listes de mots valides)<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org8d2ce92" class="outline-2">
<h2 id="org8d2ce92"><span class="section-number-2">5</span> Fait</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgb7ca920" class="outline-3">
<h3 id="orgb7ca920">Algorithme pour le calcul de la LAT et de LAM</h3>
<div class="outline-text-3" id="text-orgb7ca920">
<ul class="org-ul">
<li>voir présentation<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org481540b" class="outline-3">
<h3 id="org481540b">Lecture / parcours de fichier FASTA</h3>
</div>
<div id="outline-container-org10eddfa" class="outline-3">
<h3 id="org10eddfa">Recherche d'une libraire pour Aho-Corasick en C++</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Eric Rivals</p>
<p class="date">Created: 2022-03-24 jeu. 11:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
